<?php
namespace Error;
/**
 * 错误码设置类
 */
class CodeConfigModel {
    /**
     * 获取错误码配置
     */
    public static function getCodeConfig() {
        return array(
            "0"=>"success",
            "1"=>"error",
            "100"=>"签名错误",
            "101"=>"缺少签名",
            "102"=>"缺少参数",
            "103"=>"token失效，请登录",
            "104"=>"请求方式错误",
            "105"=>"格式错误",
            "1000"=>"请输入正确的手机号",
            "1001"=>"获取验证码频率过高，请稍后",
            "1002"=>'验证码错误',
            "1004"=>'手机号不存在，请注册',
            "1003"=>'手机号已经注册过，请登入',
            "1005"=>'验证码过期',
            "1006" =>"注册失败，请稍后再试",
            "1007"=>"账号密码错误，请稍后再试",
            "1008"=>"密码为空",
            "1009"=>'账号已经注册过,请登入',
            "1010"=>'账号不存在，请注册',
            "1011"=>'账号或者手机号已注册，请登入',
            "1012"=>'输入错误超过3次,请找回密码',
            "1013"=>'用户不存在',
            "1014"=>'输入的身份证号码有误，请输入正确的身份证号码',
            "1015"=>'该手机号已被绑定，请更换手机号',
            "1100"=>'缺少资讯ID',
            "1200"=>'缺少游戏ID',
            "1201"=>'领取礼包，请先登录',
            "1202"=>'您已领取过该礼包',
            "1203"=>'该礼包已领取完，下次请早',
            "1204"=>'领取成功',
            "1205"=>'此游戏不存在',
            "1206"=>'此礼包不存在',
            "1207"=>'该条评论不存在',
            "1208"=>'积分不足',
            "1209"=>'此资讯不存在',
            "1210"=>"缺少签到ID",
            "1211"=>"缺少补签次数",
            "1300"=>"推送失败",
            "500"=>"系统繁忙，请稍候再试"
        );
    }


}